nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz1064dab176.h
/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_SQI_XIPSDRCommandDDRDataSet(SQI_MODULE_ID index)
{
     SQI_XIPSDRCommandDDRDataSet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_XIPSDRCommandDDRDataGet(SQI_MODULE_ID index)
{
     return SQI_XIPSDRCommandDDRDataGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPSDRCommandDDRData(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPSDRCommandDDRData_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPDDRModeSet(SQI_MODULE_ID index)
{
     SQI_XIPDDRModeSet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPDDRMode(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPDDRMode_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPDummyBytesSet(SQI_MODULE_ID index, SQI_DUMMY_BYTES bytes)
{
     SQI_XIPDummyBytesSet_Default(index, bytes);
}

PLIB_INLINE_API SQI_DUMMY_BYTES PLIB_SQI_XIPDummyBytesGet(SQI_MODULE_ID index)
{
     return SQI_XIPDummyBytesGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPNumberOfDummyBytes(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPNumberOfDummyBytes_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPAddressBytesSet(SQI_MODULE_ID index, SQI_ADDR_BYTES bytes)
{
     SQI_XIPAddressBytesSet_Default(index, bytes);
}

PLIB_INLINE_API SQI_ADDR_BYTES PLIB_SQI_XIPAddressBytesGet(SQI_MODULE_ID index)
{
     return SQI_XIPAddressBytesGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPNumberOfAddressBytes(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPNumberOfAddressBytes_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPReadOpcodeSet(SQI_MODULE_ID index, uint8_t opCode)
{
     SQI_XIPReadOpcodeSet_Default(index, opCode);
}

PLIB_INLINE_API uint8_t PLIB_SQI_XIPReadOpcodeGet(SQI_MODULE_ID index)
{
     return SQI_XIPReadOpcodeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPReadOpCode(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPReadOpCode_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPLaneModeSet(SQI_MODULE_ID index, SQI_LANE_MODE dataLanes, SQI_LANE_MODE dummyLanes, SQI_LANE_MODE modeLanes, SQI_LANE_MODE addrLanes, SQI_LANE_MODE cmdLanes)
{
     SQI_XIPLaneModeSet_Default(index, dataLanes, dummyLanes, modeLanes, addrLanes, cmdLanes);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPLaneMode(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPLaneMode_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPControlWord1Set(SQI_MODULE_ID index, SQI_DUMMY_BYTES dummyBytes, SQI_ADDR_BYTES addressBytes, uint8_t readOpcode, SQI_LANE_MODE dataLaneMode, SQI_LANE_MODE dummyLaneMode, SQI_LANE_MODE modeCodeLaneMode, SQI_LANE_MODE addressLaneMode, SQI_LANE_MODE cmdLaneMode)
{
     SQI_XIPControlWord1Set_Default(index, dummyBytes, addressBytes, readOpcode, dataLaneMode, dummyLaneMode, modeCodeLaneMode, addressLaneMode, cmdLaneMode);
}

PLIB_INLINE_API uint32_t PLIB_SQI_XIPControlWord1Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord1Get_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord1(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord1_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPChipSelectSet(SQI_MODULE_ID index, SQI_CS_NUM csNum)
{
     SQI_XIPChipSelectSet_Default(index, csNum);
}

PLIB_INLINE_API SQI_CS_NUM PLIB_SQI_XIPChipSelectGet(SQI_MODULE_ID index)
{
     return SQI_XIPChipSelectGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPChipSelect(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPChipSelect_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPModeBytesSet(SQI_MODULE_ID index, SQI_MODE_BYTES bytes)
{
     SQI_XIPModeBytesSet_Default(index, bytes);
}

PLIB_INLINE_API SQI_MODE_BYTES PLIB_SQI_XIPModeBytesGet(SQI_MODULE_ID index)
{
     return SQI_XIPModeBytesGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPModeBytes(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPModeBytes_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPModeCodeSet(SQI_MODULE_ID index, uint8_t code)
{
     SQI_XIPModeCodeSet_Default(index, code);
}

PLIB_INLINE_API uint8_t PLIB_SQI_XIPModeCodeGet(SQI_MODULE_ID index)
{
     return SQI_XIPModeCodeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPModeCode(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPModeCode_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_XIPControlWord2Set(SQI_MODULE_ID index, SQI_CS_NUM devSelect, SQI_MODE_BYTES modeBytes, uint8_t modeCode)
{
     SQI_XIPControlWord2Set_Default(index, devSelect, modeBytes, modeCode);
}

PLIB_INLINE_API uint32_t PLIB_SQI_XIPControlWord2Get(SQI_MODULE_ID index)
{
     return SQI_XIPControlWord2Get_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsXIPControlWord2(SQI_MODULE_ID index)
{
     return SQI_ExistsXIPControlWord2_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_Enable(SQI_MODULE_ID index)
{
     SQI_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_Disable(SQI_MODULE_ID index)
{
     SQI_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsEnableControl(SQI_MODULE_ID index)
{
     return SQI_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_CSOutputEnableSelect(SQI_MODULE_ID index, SQI_CS_OEN csPins)
{
     SQI_CSOutputEnableSelect_Default(index, csPins);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsCSOutputEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsCSOutputEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DataOutputEnableSelect(SQI_MODULE_ID index, SQI_DATA_OEN dataPins)
{
     SQI_DataOutputEnableSelect_Default(index, dataPins);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDataOutputEnable(SQI_MODULE_ID index)
{
     return SQI_ExistsDataOutputEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ConBufferSoftReset(SQI_MODULE_ID index)
{
     SQI_ConBufferSoftReset_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConBufferSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsConBufferSoftReset_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_RxBufferSoftReset(SQI_MODULE_ID index)
{
     SQI_RxBufferSoftReset_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufferSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufferSoftReset_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TxBufferSoftReset(SQI_MODULE_ID index)
{
     SQI_TxBufferSoftReset_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufferSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufferSoftReset_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_SoftReset(SQI_MODULE_ID index)
{
     SQI_SoftReset_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsSoftReset_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_BurstEnable(SQI_MODULE_ID index)
{
     SQI_BurstEnable_Default(index);
}

